In [51]:
import pandas as pd

In [52]:
df = pd.read_table("https://data.princeton.edu/wws509/datasets/salary.dat", delim_whitespace = True)
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [53]:
df2 =pd.read_table("salary.dat.txt")
df2.head()

        sx        rk yr        dg yd    sl
0     male      full 25 doctorate 35 36350
1     male      full 13 doctorate 22 35350
2     male      full 10 doctorate 23 28200
3   female      full  7 doctorate 27 26775
4     male      full 19   masters 30 33696

# 01
# let's get down to practice!
# Transforms categories into Numbers__sex, In order to know all the options of a categorical data set,let's use Pandas' unuque 
# method,first in the sx column:

In [55]:
df['sx'].unique()

array(['male', 'female'], dtype=object)

# let's do OHE,first in the sex column:
# Turn my column into a dumy value

In [57]:
dummy = pd.get_dummies(df["sx"])
dummy.head()

   female  male
0       0     1
1       0     1
2       0     1
3       1     0
4       0     1

In [58]:
dummy = pd.get_dummies(df["sx"],drop_first=True)
dummy.head()

   male
0     1
1     1
2     1
3     0
4     1

In [59]:
df = pd.concat([df, dummy],axis=1).drop('sx', axis=1)
df.head()

     rk  yr         dg  yd     sl  male
0  full  25  doctorate  35  36350     1
1  full  13  doctorate  22  35350     1
2  full  10  doctorate  23  28200     1
3  full   7  doctorate  27  26775     0
4  full  19    masters  30  33696     1

In [60]:
cols =df.columns.tolist()

# Indexing & Slicing Techniques

cols = cols[-1:] + cols[:-1]
cols

['male', 'rk', 'yr', 'dg', 'yd', 'sl']

# now bring the table in personalise columns order:

In [62]:
df = df[cols]
df.head()

   male    rk  yr         dg  yd     sl
0     1  full  25  doctorate  35  36350
1     1  full  13  doctorate  22  35350
2     1  full  10  doctorate  23  28200
3     0  full   7  doctorate  27  26775
4     1  full  19    masters  30  33696

# 02
# Transforms categories into Numbers____Rank
# now let's deal with rank(rk):

In [64]:
df['rk'].unique()

array(['full', 'associate', 'assistant'], dtype=object)

# Creating another dummy set:
# Turn my column into a dumy value

In [68]:
dummy2 = pd.get_dummies(df['rk'])

In [69]:
dummy2.head()

   assistant  associate  full
0          0          0     1
1          0          0     1
2          0          0     1
3          0          0     1
4          0          0     1

# Let's concatenate this second dummy db:

In [71]:
df = pd.concat([df, dummy2], axis=1).drop('rk', axis=1)
df.head()

   male  yr         dg  yd     sl  assistant  associate  full
0     1  25  doctorate  35  36350          0          0     1
1     1  13  doctorate  22  35350          0          0     1
2     1  10  doctorate  23  28200          0          0     1
3     0   7  doctorate  27  26775          0          0     1
4     1  19    masters  30  33696          0          0     1

# 03
# Now the last one (dg= Highest degree,coded 1 if doctorate, 0 if masters):

In [73]:
df['dg'].unique()

array(['doctorate', 'masters'], dtype=object)

In [74]:
# Turn my colunm into a dummy value

In [75]:
dummy3 = pd.get_dummies(df["dg"])

dummy3.head()

   doctorate  masters
0          1        0
1          1        0
2          1        0
3          1        0
4          0        1

In [76]:
# let's simplify it once more
dummy3 = dummy3.drop('masters',axis=1)
dummy3.head()

   doctorate
0          1
1          1
2          1
3          1
4          0

# we almost there, Concatenating now...

In [80]:
df = pd.concat([df, dummy3], axis=1).drop('dg', axis=1)

df.head()

   male  yr  yd     sl  assistant  associate  full  doctorate
0     1  25  35  36350          0          0     1          1
1     1  13  22  35350          0          0     1          1
2     1  10  23  28200          0          0     1          1
3     0   7  27  26775          0          0     1          1
4     1  19  30  33696          0          0     1          0

# Now the Datasets is ready.